# -*- coding: utf-8 -*-
"""Anagram_text

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1lKJpo3ulRswNLAr0qQhos7gYNdaUHRWS
"""

# Анаграммы
# На вход программе подаются два предложения. Напишите программу, которая определяет, являются они анаграммами или нет.
#  Ваша программа должна игнорировать регистр символов, знаки препинания и пробелы.

# Формат входных данных
# На вход программе подаются два предложения, каждое на отдельной строке.

# Формат выходных данных
# Программа должна вывести YES , если предложения – анаграммы и NO в противном случае.

# Примечание. Кроме слов в тексте могут присутствовать пробелы и знаки препинания .,!?:;-. Других символов в тексте нет.

dct1, dct2 = {}, {}
for c in input().lower() :
    if c.isalpha() :
        dct1[c] = dct1.get(c, 0) + 1
for c in input().lower() :
    if c.isalpha() :
        dct2[c] = dct2.get(c, 0) + 1
print(('NO', 'YES')[dct1 == dct2])