# -*- coding: utf-8 -*-
"""Anagram_word

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1lKJpo3ulRswNLAr0qQhos7gYNdaUHRWS
"""

# Анаграммы
# Анаграмма – слово (словосочетание), образованное путём перестановки букв, составляющих другое слово (или словосочетание). Например, английские слова evil и live – это анаграммы.

# На вход программе подаются два слова. Напишите программу, которая определяет, являются ли они анаграммами.

# Формат входных данных
# На вход программе подаются два слова, каждое на отдельной строке.

# Формат выходных данных
# Программа должна вывести YES если слова являются анаграммами и NO в противном случае.

s1, s2 = input(), input()
dct1, dct2 = {}, {}
for c in s1 :
    dct1[c] = dct1.get(c, 0) + 1
for c in s2 :
    dct2[c] = dct2.get(c, 0) + 1
print(('NO', 'YES')[dct1 == dct2])


# Вариант без словарей
s1, s2 = input(), input()
print(('NO','YES')[sorted(s1) == sorted(s2)])